{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":12544,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,100],"dtype":"float32"}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU1","trainable":true}},{"class_name":"Reshape","config":{"target_shape":[7,7,256],"name":"reshape_Reshape1","trainable":true}},{"class_name":"Conv2DTranspose","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose1","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU2","trainable":true}},{"class_name":"Conv2DTranspose","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[2,2],"padding":"same","data_format":"channels_last","activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose2","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU3","trainable":true}},{"class_name":"Conv2DTranspose","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[2,2],"padding":"same","data_format":"channels_last","activation":"tanh","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose3","trainable":true}}]},"keras_version":"tfjs-layers 1.7.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[100,12544],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[12544],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[12544],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[12544],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/kernel","shape":[5,5,128,256],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose2/kernel","shape":[5,5,64,128],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose2/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose3/kernel","shape":[5,5,1,64],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose3/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[12544],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[12544],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[64],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.1","convertedBy":null}